<?php
$_['text_payment'] = 'Оплата';
$_['text_order'] = 'Заказы';
$_['entry_reg'] = 'Для работы плагина необходимо подключить магазин к <a style="text-decoration:underline" target="_blank" href="https://mixplat.ru/">MIXPLAT</a>';
$_['entry_modinfo'] = 'Информация о плагине MIXPLAT';
$_['entry_modver'] = 'Версия плагина:';
$_['entry_shopver'] = 'Версия магазина:';
$_['entry_status'] = 'Статус:';
$_['entry_server'] = 'Тестовый режим работы:';
$_['help_server'] = 'Вы можете проверить работу плагина в тестовом режиме, прежде чем начнете принимать реальные платежи. В тестовом режиме допускается использовать только специальные номера карт и номера телефонов из <a href=\'#\' target=\'_blank\'>соответствующего списка</a>. Каждый тестовый номер будет предоставлять вам разные результаты проведения платежа, чтобы вы могли протестировать все ответы от системы MIXPLAT.';
$_['entry_debug'] = 'Режим отладки:';
$_['help_debug'] = 'Прерывает переход на оплату и выводит передаваемые данные на экран';
$_['entry_name_tab'] = 'Название метода оплаты:';
$_['entry_name_ro'] = 'Банковской картой через MIXPLAT';
$_['entry_name_ro-en'] = 'Bank card via MIXPLAT';
$_['text_default'] = 'По умолчанию';

$_['entry_kabinfo'] = 'Настройки из личного кабинета MIXPLAT';
$_['entry_password'] = 'Ключ API:';
$_['entry_project_id'] = 'ID проекта:';
$_['entry_payment_form_id'] = 'ID платёжной формы:';

$_['entry_payinfo'] = 'Настройки оплаты';
$_['entry_twostage'] = 'Способ транзакции:';
$_['text_onestage'] = 'Одностадийная';
$_['text_twostage'] = 'Двухстадийная (с холдированием)';
$_['help_twostage'] = 'При одностадийной авторизации платеж подтверждается автоматически, деньги со счета покупателя списываются сразу.
Для двухстадийной системы у вас есть до 7 дней для подтверждения платежа (иначе деньги автоматически вернутся покупателю), либо отмены (операция пройдет без комиссии). Подтвердить или отменить платёж вы можете в меню платежей или в личном кабинете MIXPLAT.';
$_['entry_otlog'] = 'Режим перехода к оплате:';
$_['help_otlog'] = 'Стандартный - оплата сразу после оформления заказа.<br>Отложенная оплата - Разрешена только после проверки заказа.<br>Контроль наличия товаров - Все товары в корзине в наличии - работает стандартный режим, все или несколько товаров не в наличии - работает отложенный режим.';
$_['entry_otlog_standard'] = 'Стандартный';
$_['entry_otlog_pay'] = 'Отложенная оплата';
$_['entry_otlog_stock'] = 'Контроль наличия товаров';
$_['entry_komis'] = 'Комиссия или скидка с покупателя:<br/><small>Для скидки установите отрицательное значение.</small>';
$_['entry_fixen'] = 'Cумма к оплате:';
$_['entry_fixen_order'] = 'По умолчанию (стоимость заказа)';
$_['entry_fixen_proc'] = 'Процент от заказа';
$_['entry_fixen_fix'] = 'Фиксированная';
$_['entry_fixen_amount'] = 'Укажите процент:';
$_['entry_fixen_amount2'] = 'Укажите фиксированную сумму:';
$_['entry_button_later'] = 'Кнопка "Оплатить позже" в оформлении заказа:';
$_['help_button_later'] = 'Если выбрано «Да», то при оформлении заказа будет отображаться две кнопки - стандартная «Оплатить» и дополнительная кнопка «Оплатить позже».';
$_['entry_geo_zone'] = 'Регион доступности оплаты:';
$_['entry_sort_order'] = 'Сортировка:';

$_['entry_fzinfo'] = 'Отправка онлайн-чеков по 54-ФЗ';
$_['entry_cart'] = 'Данные для чеков:';
$_['entry_cart_on'] = 'Отправлять';
$_['entry_cart_off'] = 'Не отправлять';
$_['help_cart'] = 'Для включения отправки чеков необходимо произвести настройки в личном кабинете MIXPLAT в разделе <a href=\'#\' target=\'_blank\'>фискализация</a>';
$_['entry_tax_system_code'] = 'Система налогообложения магазина:';
$_['text_tax_system_code_1'] = 'Общая система налогообложения (с НДС)';
$_['text_tax_system_code_2'] = 'Упрощенная (УСН, доходы)';
$_['text_tax_system_code_3'] = 'Упрощенная (УСН, доходы минус расходы)';
$_['text_tax_system_code_4'] = 'Патентная система налогообложения';
$_['text_tax_system_code_5'] = 'Единый сельскохозяйственный налог (ЕСН)';
$_['text_tax_system_code_6'] = 'Единый налог на вмененный доход (ЕНВД)';
$_['entry_nds_important'] = 'НДС по умолчанию:';
$_['help_nds_important'] = 'Это значение подставляется по умолчанию для всех товаров, если иное не было указано в карточке товара.';
$_['entry_nds'] = 'Подставлять НДС товара из карточки товара';
$_['entry_nds_tovar'] = 'Да';
$_['entry_tax'] = 'Налоги указанные в карточке товаров';
$_['help_tax'] = 'Обязательно создайте налоговый класс (система-локализация-налоги-налоговый класс), если первое поле справа пустое.
Обратите внимание, что налоговые ставки создавать не нужно. Укажите нужный налоговый класс в редактировании товара, а в селекторах справа установите соответствие вашего налогового класса ставке НДС.';
$_['entry_nds_important_1'] = '20%';
$_['entry_nds_important_2'] = '20/120';
$_['entry_nds_important_3'] = '10%';
$_['entry_nds_important_4'] = '10/110';
$_['entry_nds_important_5'] = '0%';
$_['entry_nds_important_6'] = 'Без НДС';
$_['entry_customShip'] = 'Альтернативное название доставки в чеке:';
$_['help_customShip'] = 'Название доставки всегда будет заменяться на указанное, при пустом значении поля замена не производится';
$_['entry_show_free_shipping']      = 'Показывать бесплатную доставку:';
$_['help_show_free_shipping']      = 'Если у доставки будет цена 0, то она будет отображена в чеке.';
$_['entry_shipping_tax']      = 'НДС доставки:';
$_['entry_payment_mode_default'] = 'Признак способа расчёта по умолчанию:';
$_['text_payment_mode_default_full_prepayment'] = 'Полная предоплата';
$_['text_payment_mode_default_partial_prepayment'] = 'Частичная предоплата';
$_['text_payment_mode_default_advance'] = 'Аванс';
$_['text_payment_mode_default_full_payment'] = 'Полный расчет';
$_['text_payment_mode_default_partial_payment'] = 'Частичный расчет и кредит';
$_['text_payment_mode_default_credit'] = 'Кредит';
$_['text_payment_mode_default_credit_payment'] = 'Выплата по кредиту';
$_['entry_payment_mode_source'] = 'Признак способа расчета из карточки товара:';
$_['help_payment_mode_source'] = 'Значение по умолчанию будет заменено на значение указанного поля карточки товара. Как правильно заносить значения в поля описано в <a>документации</a>. Если данное поле окажется пустым или заполненным невалидно, то будет использовано значение по умолчанию.';
$_['entry_payment_subject_default'] = 'Признак предмета расчета по умолчанию:';
$_['text_payment_subject_default_commodity'] = 'Товар';
$_['text_payment_subject_default_excise'] = 'Подакцизный товар';
$_['text_payment_subject_default_job'] = 'Работа';
$_['text_payment_subject_default_service'] = 'Услуга';
$_['text_payment_subject_default_gambling_bet'] = 'Ставка в азартной игре';
$_['text_payment_subject_default_gambling_prize'] = 'Выигрыш в азартной игре';
$_['text_payment_subject_default_lottery'] = 'Лотерейный билет';
$_['text_payment_subject_default_lottery_prize'] = 'Выигрыш в лотерею';
$_['text_payment_subject_default_intellectual_activity'] = 'Результаты интеллектуальной деятельности';
$_['text_payment_subject_default_payment'] = 'Платеж';
$_['text_payment_subject_default_agent_commission'] = 'Агентское вознаграждение';
$_['text_payment_subject_default_composite'] = 'Несколько вариантов';
$_['text_payment_subject_default_another'] = 'Другое';
$_['entry_payment_subject_source'] = 'Признак предмета расчета из карточки товара:';
$_['help_payment_subject_source'] = 'Значение по умолчанию будет заменено на значение указанного поля карточки товара. Как правильно заносить значения в поля описано в <a>документации</a>. Если данное поле окажется пустым или заполненным невалидно, то будет использовано значение по умолчанию.';
$_['entry_customName'] = 'Альтернативное название товара в чеке:';
$_['help_customName'] = 'Стандартное название товара будет заменено из указанного поля карточки товара.';
$_['text_0'] = 'Не использовать данные из карточки товара';
$_['text_upc'] = 'UPC';
$_['text_ean'] = 'EAN';
$_['text_jan'] = 'JAN';
$_['text_isbn'] = 'ISBN';
$_['text_mpn'] = 'MPN';
$_['text_location'] = 'Расположение';

$_['entry_afterpay'] = 'Настройки действий после оплаты';
$_['text_createorder_or_notcreate'] = 'Создавать заказ после оплаты:';
$_['help_createorder_or_notcreate'] = 'Если «Нет» то заказ создатся сразу, независимого от того прошла оплата или нет.';
$_['entry_success_alert_admin_tab'] = 'Письмо администратору при успешной оплате';
$_['entry_success_alert_customer_tab'] = 'Письмо покупателю при успешной оплате';
$_['entry_start_status'] = 'Статус после оформления заказа';
$_['entry_on_status'] = 'Статус заказа после неуспешной или ожидаемой оплаты';
$_['entry_on_status2'] = 'Статус для активной оплаты';
$_['entry_order_status'] = 'Статус после удачной оплаты';

$_['entry_texts'] = 'Настройка текстов и шаблонов';
$_['entry_texts1'] = 'Настройки текстов на сайте';
$_['entry_texts2'] = 'Настройки текстов e-mail';
$_['entry_instruction_tab'] = 'Использовать инструкцию при оформлении заказа?';
$_['entry_instruction'] = 'Инструкция при оформлении заказа:';
$_['entry_mail_instruction_tab'] = 'Использовать инструкцию в письме с заказом?';
$_['entry_mail_instruction'] = 'Инструкция в письме с заказом:';
$_['entry_success_comment_tab'] = 'Использовать комментарий покупателю<br>в письме о успешной оплате?';
$_['entry_success_comment'] = 'Комментарий покупателю<br>в письме о успешной оплате:';
$_['entry_hrefpage_tab'] = 'Текст на странице после перехода<br>по ссылке из письма или из личного кабинета:';
$_['entry_hrefpage'] = 'Текст на странице после перехода<br>по ссылки из письма или из личного кабинета:';
$_['entry_success_page_tab'] = 'Текст на странице успешной оплаты?';
$_['entry_success_page_text'] = 'Текст на странице успешной оплаты:';
$_['entry_waiting_page_tab'] = 'Текст на странице ожидаемой оплаты?';
$_['entry_waiting_page_text'] = 'Текст на странице ожидаемой оплаты:';
$_['entry_fail_page_tab'] = 'Текст на странице не успешной оплаты?';
$_['entry_fail_page_text'] = 'Текст на странице не успешной оплаты:';
$_['text_my'] = 'Произвольный';
$_['help_var'] = 'Поддерживает переменные:<br>$pay_link$ - ссылка на оплату<br>$order_id$ - номер заказа<br>$amount$ - сумма заказа<br>$fee$ - комисcия в процентах<br>$amount_fee$ - комисcия в рублях<br>$sum_fee$ - сумма с комиссией<br>а также html теги.';
$_['help_var2'] = 'Поддерживает переменные:<br>$order_id$ - номер заказа<br>$amount$ - сумма заказа';

$_['text_success'] = 'Настройки сохранены';
$_['pay_text_mail'] = 'Перейти на оплату можно по ссылке ';
$_['pay_text_admin'] = 'Ссылка на оплату:';

//Ошибки
$_['error_project_id'] = 'Введите ID проекта';
$_['error_payment_form_id'] = 'Введите ID платёжной формы';
$_['error_password'] = 'Введите ключ API';
$_['error_name'] = 'Введите название метода оплаты';
$_['error_fixen'] = 'Введите число';

//Статус
$_['heading_title_status'] = 'MIXPLAT оплаченные заказы';
$_['status_title'] = 'Оплаченные заказы';
$_['id'] = 'ID';
$_['num_order'] = 'Номер заказа';
$_['sum'] = 'Сумма';
$_['label'] = 'Итог';
$_['status'] = 'Статус';
$_['user'] = 'Пользователь';
$_['email'] = 'email';
$_['date_created'] = 'Дата создания';
$_['date_enroled'] = 'Дата оплаты';
$_['sender'] = 'Идентификатор операции';

$_['entry_capture2'] = 'Подтвердить';

$_['status_list_1'] = 'Завершен';
$_['status_list_2'] = 'Ожидает подтверждения';
$_['status_list_3'] = 'Отменен';

$_['status_nodata'] = 'Нет данных';
$_['text_status'] = 'Список платежей';
$_['text_capture'] = 'Подтвердить платеж';
$_['text_cancel'] = 'Отменить платеж';
$_['text_status_info'] = 'Информация о платеже';
$_['text_status_true'] = 'Да';
$_['text_status_false'] = 'Нет';
$_['text_cancel_error'] = 'Отмена платежа не удалась!';
$_['text_cancel_success'] = 'Отмена платежа прошла успешно!';
$_['text_cancel_error_perrmission'] = 'Недостаточно прав! Разрешите доступ к sale/order для текущей группы пользователя!';
$_['text_capture_error'] = 'Подтвердить платеж не удалось!';
$_['text_capture_success'] = 'Подтверждение платежа прошло успешно!';
$_['text_capture_error_perrmission'] = 'Недостаточно прав! Разрешите доступ к sale/order для текущей группы пользователя!';

$_['stat_result'] = 'Результат выполнения запроса';
$_['stat_project_id'] = 'ID проекта в MIXPLAT, для которого был создан платёж.';
$_['stat_test'] = 'Признак тестового платежа';
$_['stat_merchant_payment_id'] = 'ID платежа в ТСП, или NULL, если он не был указан при создании платежа.';
$_['stat_merchant_data'] = 'Произвольные данные ТСП, связанные с платежом, или NULL, если они не были указаны при создании платежа.';
$_['stat_status'] = 'Статус платежа';
$_['stat_status_extended'] = 'Расширенный статус платежа';
$_['stat_date_created'] = 'Дата и время создания платежа (по Москве)';
$_['stat_date_processed'] = 'Дата и время обработки платежа (по Москве), или NULL, если платёж ещё обрабатывается';
$_['stat_currency'] = 'Валюта платежа';
$_['stat_amount'] = 'Сумма платежа в минорных единицах (копейках)';
$_['stat_amount_user'] = 'Сумма, фактически оплаченная плательщиком в минорных единицах (копейках)';
$_['stat_amount_merchant'] = 'Сумма к выплате ТСП в минорных единицах (копейках)';
$_['stat_payment_method'] = 'Платёжный метод, который был использован для оплаты';
$_['stat_payment_method_group'] = 'Группа платёжных методов, к которой относится платёжный метод';
$_['stat_user_phone'] = 'Номер телефона абонента';
$_['stat_mobile'] = 'Дополнительная информация о платеже, специфичная для группы платёжных методов mobile';
$_['stat_card'] = 'Дополнительная информация о платеже, специфичная для группы платёжных методов card';
$_['stat_pan'] = 'Номер карты';
$_['stat_issuer'] = 'issuer';
$_['stat_3ds'] = '3ds';

$_['stat_val_success'] = 'Платёж успешен (финальный статус)';
$_['stat_val_failure'] = 'Платёж неуспешен (финальный статус)';
$_['stat_val_pending'] = 'Платёж обрабатывается (промежуточный статус)';
$_['stat_extended_val_success_success'] = 'Платёж успешен';

//подверждение отмена
$_['heading_title_capture'] = 'Статус платежа. MIXPLAT';

//письма
$_['text_history'] = '<a href="%1$s" class="button">Оплатить онлайн</a>';
$_['text_stat'] = 'Перейдите по ссылке для оплаты онлайн';
$_['merchant_url'] = '<a href="%1$s" class="button">%1$s</a>';
?>